#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//
//int main() {
////    //2. 算术操作符    +  -  *  /  %
////    // /除法
////    int a1 = 7 / 2;
////    printf("a1 = %d\n",a1);
////    double a2 = 7 / 2;
////    printf("a2 = %lf\n",a2);
////    double a3 = 7.0 / 2;
////    printf("a3 = %lf\n",a3);
////    //%取模
////    printf("%d\n",3%2);  //1
////
////
////
////    //3.移位操作
////    int a4 = -15;
////    int b4 = a4 >> 1;
////    printf("%d\n",b4);  //-8
////    printf("%d\n",a4);  //不变，还是-15
////
////
////
////    //4.位操作符
////    //按位与&
////    int a5 = 3;
////    //00000000000000000000000000000011 - 补码
////    int b5 = -5;
////    //10000000000000000000000000000101 - 原码
////    //11111111111111111111111111111010 - 反码
////    //11111111111111111111111111111011 - 补码
////    int c51 = a5 & b5;
////    //a:00000000000000000000000000000011
////    //b:11111111111111111111111111111011
////    //c:00000000000000000000000000000011  ---> 计算值为 [1 * 2^1]+[1 * 2^0] = 3
////    printf("c51 = %d\n",c51);
////    //按位或|
////    int c52 = a5 | b5;
////    //a:00000000000000000000000000000011
////    //b:11111111111111111111111111111011
////    //c:11111111111111111111111111111011 --补码
////    //  11111111111111111111111111111010 --反码
////    //  10000000000000000000000000000101 --原码  ---> 计算值为 [1 * 2^2]+[0 * 2^1]+[1 * 2^0] = -5
////    printf("c52 = %d\n",c52);
////    //按位异或^
////    int c53 = a5 ^ b5;
////    //a:00000000000000000000000000000011
////    //b:11111111111111111111111111111011
////    //c:11111111111111111111111111111000 --补码
////    //  11111111111111111111111111110111 --反码
////    //  10000000000000000000000000001000 --原码  ---> 计算值为 [1 * 2^3]+[0 * 2^2]+[0 * 2^1]+[0 * 2^0] = -8
////    printf("c53 = %d\n",c53);
////
////    //习题
////    int a = 10;
////    int b = 20;
////    a = a^b;
////    b = a^b;
////    a = a^b;
////    printf("a = %d b = %d\n", a, b);
////
////
////
////    //赋值运算符
////    int w = 12;
////    printf("Before w is: %d\n",w);
////    w = 89;
////    printf("After w is: %d\n",w);
////    double s = 1000.0;
////    printf("Before w is: %lf\n",s);
////    s = 20000.0;
////    printf("Before s is: %lf\n",s);
////
////
////
//    //单目操作符
//    int a = 10;
//    int x = ++a;
//    //先对a进行自增，然后对使用a，也就是表达式的值是a自增之后的值。x为11。
//    printf("x = %d\n",x);
//    printf("a = %d\n",a);
//    int y = --a;
//    //先对a进行自减，然后对使用a，也就是表达式的值是a自减之后的值。y为10;
//    printf("y = %d\n",y);
//    printf("a = %d\n",a);
//    return 0;
//}

#include <stdio.h>
struct Stu
{
    char name[10];
    int age;
    char sex[5];
    double score;
};
int set_age1(struct Stu stu)
{
    stu.age = 18;
    return stu.age;
}
void set_age2(struct Stu* pStu)
{
    pStu->age = 18;//结构成员访问
}
int main()
{
    struct Stu stu;
    struct Stu* pStu = &stu;//结构成员访问

    int a = set_age1(stu);
    printf("stu = %d\n", a); //打印结果就为18

    pStu->age = 20;//结构成员访问
    set_age2(pStu);
    return 0;
}
