#include <stdio.h>
#include <limits.h>

int check_sys();

int main() 
{
    /*整形在内存中的存储*/
    //INT_MAX;
    //原码、反码、补码
    int num1 = 10; //创建一个整形变量,这是num向内存申请了4个字节来存放数据
    //num1地址为0a 00 00 00(0000 0000   0000 0000   0000 0000   0000 1010)
    //本质上内存中存放的是二进制,为了方便展示,显示的是16进制(倒着存储)
    /*4个字节---32个比特位
    *正整数的原反补码全相同
    *10的码为:
    *0 0000000000000000000000000001010--原码
    *0 0000000000000000000000000001010--反码
    *0 0000000000000000000000000001010--补码 */

    int num2 = -10;
    //num1地址为0a 00 00 00
    /*10的码为:
    *1 0000000000000000000000000001010--原码
    *1 1111111111111111111111111110101--反码
    *1 1111111111111111111111111110110--补码(反码加1) */

    //计算1+(-1)
    /*00000000000000000000000000000001--1的补码
    *11111111111111111111111111111111--(-1的补码)
    *相加(满2进1,1变0,0变1)
    *00000000000000000000000000000000--正好得0*/



    //大小端
    //小端字节序存储:把一个数据的低位字节的内容,存放在低地址处;把一个数据的高位字节的内容,存放在高地址处.
    //大端字节序存储:把一个数据的低位字节的内容,存放在高地址处;把一个数据的高位字节的内容,存放在低地址处.
    int a = 0x11223344; //地址为44 33 22 11(小端存储)

    //例子:判断大小端
    int ret = check_sys();
    if(ret == 1)
    {
        printf("small\n");
    }
    else
    {
        printf("big\n");
    }


    char aa= -1;
   /*10000000000000000000000000000001 -- 原码
    *11111111111111111111111111111110 -- 反码
    *111111111111111111111111 11111111 -- 补码
    *11111111 --aa
    *11111111111111111111111111111111 (整数提升后的补码)(有符号补1,无符号补0)
    *11111111111111111111111111111110
    *10000000000000000000000000000001 -- -1 */

    signed char b=-1;
   /*111111111111111111111111 11111111
    *11111111 -- b (跟a一样)*/

    unsigned char c=-1;
   /*11111111 -- c
    *00000000000000000000000011111111 -- 补码
    *00000000000000000000000011111111
    *00000000000000000000000011111111 -- 原码*/
    printf("aa = %d, b = %d, c = %d\n",aa,b,c); //%d--十进制的形式打印有符号整形整数 整型提升


    char aaa = -128;
   /*10000000000000000000000010000000
    *11111111111111111111111101111111
    *11111111111111111111111110000000 -- 补码
    *10000000 --a
    *11111111111111111111111110000000*/
    printf("%u\n",aaa); //打印的是无符号的数,原反补相同


    /*浮点数n在内存中的存储*/  //?????
    int n = 9;
    float* pfloat = (float*)&n;
    printf("n num is %d\n", n);  //9
    printf("*pfloat num is %f\n", *pfloat); //0.000000
    *pfloat = 9.0;
    printf("n num is %d\n", n); //1091567616
    printf("*pfloat num is %f\n", *pfloat); //9.0000000
    return 0;
}
int check_sys()
{
    int i = 1;
    return (*(char *)&i);
}